Revit API Introduction Labs
Lab3_7_DeleteFamilyType Class
 Delete a specific individual type from a family. Hard-coded to a column type named "475 x 610mm".
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_7_DeleteFamilyType : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_7_DeleteFamilyType _
	Implements IExternalCommand
Visual C++
public ref class Lab3_7_DeleteFamilyType : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_7_DeleteFamilyType
See Also
Lab3_7_DeleteFamilyType Members
Labs Namespace